// © Copyright 2012-2016 HP Development Company, L.P.

TaskName = "HP-tulostimen verkkopalvelut";
TaskTOCTitle = "HP:n verkkopalvelut";
SummarySucceededTaskName = "HP:n verkkopalvelut on aktivoitu!";
SummaryFailedTaskName = "HP:n verkkopalveluita ei voi aktivoida";
SummaryUpdateAvailableName = "Päivitys saatavilla";
SummaryTaskTOCTitle = "Yhteenveto";

EnableWebServicesButtonTitle = "Kyllä, hyväksyn käyttöehdot.";
SkipWebServicesEnablingCaption = "Jos et halua ottaa verkkopalvelut käyttöön, valitse Ohita.";

AlreadyEnabledTitle = "Tulostimen liittäminen verkkoon onnistui!\nHP:n Internetiin yhteydessä oleva tulostimen tarjoavat jännittäviä ja innovatiivisia uusia palveluita kuten HP Touchsmart Apps, ePrint ja automaattiset tuotepäivitykset. Katso lisätietoja näistä palveluita tuotteen oppaasta tai käy osoitteessa";
AlreadyEnabledText = "HP:n verkkopalvellut on jo aktivoitu tulostimellesi. Napsauta painiketta ja tulosta sivu, jossa on lisätietoja ja ePrint-osoite tälle tulostimelle.";
PrintWebServicesDetailsButtonTitle = "Tulosta HP:n verkkopalveluiden tiedot";
EPrintCenterLink = "http://www.hp.com/go/eprintcenter";

UpdateIsAvailableCaption = "Laitteelle on saatavilla päivitys, jota verkkopalveluiden käyttö edellyttää. Ota päivitys käyttöön painamalla ePrint-painiketta. Sinua opastetaan toimissa.";

LookingForDeviceUpdateProgressTitle = "Laite etsii päivityksiä… Odota.";
EnableWebServicesProgressTitle = "Määritetään verkkopalveluita tulostimellesi… Odota.";

WebServicesEnablingSucceededCaption = "Verkkopalvelut otettiin käyttöön tulostimella.\n\nTulostin tulostaa nyt sivun, joka sisältää lisätietoja HP:n verkkopalveluista ja tulostimen ePrint-osoitteesta.";
WebServicesEnablingFailedCaption = "HP:n verkkopalveluita ei voitu aktivoida tälle tulostimelle tällä kertaa. Tämä voi olla Internet-yhteyden tilapäinen ongelma verkkopalveluun tai tulostimesi voi vaatia tuotepäivityksen.\r\rKokeile HP:n verkkopalveluiden aktivointia myöhemmin uudelleen painamalla ePrint-painiketta tulostimessasi. Jos tuotepäivitystä vaaditaan, sinut opastetaan verkkopalveluiden määritysten läpi myöhemmin.\r\rTämä ei vaikuta tulostimesi muihin ominaisuuksiin. Tulostimellasi voi edelleen tulostaa ja suorittaa sen muut toiminnot tavallisesti.";

HSDProductUpdate = "Tuotepäivitykset:";
HSDAutomaticalyUpdate = "Päivitä tuote automaattisesti (suositus)";
HSDNotifyBeforeUpdate = "Ilmoita päivityksestä ennen kuin tuote päivitetään";
HSDNeverUpdate = "Älä päivitä tuotetta koskaan";

HSDDisableWebServicesTitle = "Haluatko poistaa verkkopalvelut käytöstä?";
HSDAllowProductUpdatesTitle = "Sallitaanko tuotepäivitykset?";
HSDAllowProductUpdatesText = "Tulostimen on annettava hakea päivityksiä, jotta verkkopalveluja voisi käyttää.";
HSDDisableWebServices = "Poista verkkopalvelut käytöstä";
HSDUpdateAutomatically = "Päivitä automaattisesti";
HSDNotifyBeforeUpdating = "Ilmoita ennen päivitystä";
